app/views/lists/show.html.erb

SELECT "movies".* FROM "movies" INNER JOIN "bookmarks" ON "movies"."id" = "bookmarks"."movie_id" WHERE "bookmarks"."list_id" = $1  [["list_id", 1]]
---
<ul>
  <% @list.movies.each do |movie| %>

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."list_id" = $1  [["list_id", 1]]
---
<ul>
  <% @list.bookmarks.each do |bookmark| %>