app/views/bookmarks/new.html.erb

<%= simple_form_for [@list, @bookmark] do |f| %>
  <%= f.input :movie_id, collection: Movie.all %>
---
SELECT "movies".* FROM "movies"