app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)

    if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["created_at", "2023-05-25 22:16:29.091082"], ["updated_at", "2023-05-25 22:16:29.091082"]]